Revit 2027 API
TextNoteOptions Constructor
 Default constructor; populates the options with their respective default values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TextNoteOptions()
Public Sub New
public:
TextNoteOptions()
new : unit -> TextNoteOptions
Remarks
 The constructed options need to be given a typeId before it can be used to create a text note.
See Also
Reference
TextNoteOptions Class
TextNoteOptions Overload
Autodesk.Revit.DB Namespace